{
    "A bustling waterway amidst stone and steel, where the flow never sleeps.": "Fishing in the City River.",
    "A great place on a Ferris Wheel, or an Arcade. Omg Donuts and Slush": "Fishing in at the Beach Pier",
    "A hidden paradise among trees, where the waters reflect the canopy above.": "Fishing in The Grove",
    "A peaceful place filled with birds chirping, the beating heart of the earth.": "Fishing in The Woodland Lake",
    "As strong as they come, very reliable": "Chopping Oak trees with Forestry",
    "Can't beat a good old Bacon Butty": "Killing Pigs in the Battle Arena",
    "Contains information about things, well, technically this one doesn't, but usually they do": "Crafting the Bestiary in the Workshop",
    "Can't touch this": "Brewing the Invincibility Potion with Apothecary",
    "Despite the name , I would not recommend giving this guy a cuddle": "Killing Fluffy in the Battle Arena",
    "Did I get this one right? It is blue, right?": "Killing the Baby Blue Dragon in the Battle Arena",
    "Do these only work? Well, only one way to find out": "Brewing Normal Luck Potions at the Apothecary",
    "Do we really know more about space?": "Fishing in the Open Ocean",
    "Don't hit me on the head": "Crafting Nails in the Workshop",
    "Evergreen Tree, often red in color": "Chopping Cedar trees in Forestry",
    "Don't touch the butt": "Cooking Clownfish in the Kitchen",
    "Fair enough, I'm partially colourblind, so yes, I got this one a little off": "Killing Green Dragons in the Battle Arena",
    "He can help me practice my bow skills, or just show off with his.": "Killing Elven Archers in the Battle Arena",
    "Give a man a fish, feed him for a day. Teach a man to fish feed him for a lifetime.": "Crafting Normal Fishing Nets in the Workshop",
    "For Cognium!": "Killing Crocodiles in the Battle Arena",
    "How did I even catch this?": "Cooking Octopus in the Kitchen",
    "How on earth did a trolley get in there?": "Fishing in the Small Pond",
    "How on earth does this not make me rich behind my wildest dreams": "Mining Gold ore in the Mines",
    "I ain't eating that, looks like it's still on fire!": "Cooking Dragon Platters in the Kitchen",
    "I am found in all kinds of plants and animals across the earth and used as a defence mechanism": "Brewing Poison Potions at the Apothecary",
    "I am found in the darkness and have many eyes": "Killing the Giant Cave Spider in the Battle Arena",
    "I am the king of greatly feared creatures, fire is my breath": "Killing the King Dragon in the Battle Arena.",
    "I come in many types, King is my most well known": "Killing Cobras in the Battle Arena.",
    "I could make some syrup, well, not on this game, but maybe one day?": "Chopping Maple Trees with Forestry.",
    "I feel harsh pickpocketing him, but I need money too you know": "Thieving from the Bard in the Thieving Guild.",
    "I gotta go, we got cows": "Brewing Cyclone Potions at the Apothecary.",
    "I lead an ancient forgotten tribe": "Killing the Ancient Tribal Leader in the Battle Arena",
    "I prefer nice dreams?": "Killing the Nightmare in the Battle Arena",
    "I must be aware of all the needles": "Chopping Pine Trees with Forestry",
    "I shall rise from the ashes, and become reborn again.": "Killing the Phoenix in the Battle Arena",
    "I wonder if thats where the name comes from?": "Chopping Cherry Blossom Trees with Forestry",
    "I think we have a slight problem, that my friend is what we call a lot of snow!": "Brewing Avalanche Potions at the Apothecary",
    "I'm a queen of a newly discovered realm": "Killing the Elven Queen in the Battle Arena",
    "I'm gonna take this night, and make it…": "Chopping Evergreen Trees with Forestry",
    "I'm smart so I wish people would acknowledge that": "Killing the Dummy Queen in the Battle Arena",
    "I'm sorry but I'm on team egg": "Killing the Normal Chickens in the Battle Arena",
    "It's not real, I mean, if it was it would be cool though right?": "Mining Dragon Ore in The Mines",
    "Is this even edible?": "Cooking the Bone Stew in the Kitchen.",
    "If I get caught, he better not give me a job to do": "Thieving from the Taskmaster in the Thieving Guild",
    "Karen, activate insta kill!": "Brewing Liquid Death Potions at the Apothecary",
    "Named after a place near where I grew up. Quite a few things are actually.": "Fishing at The Livingstone Island",
    "Money don't grow on trees and I'm B-R-O-K-E": "Chopping Oak Trees with Forestry",
    "Now I know how Midas felt": "Brewing Golden Touch Potions at the Apothecary",
    "On a diet? Nope, but this makes for some good healing": "Cooking Fruit Salad in the Kitchen",
    "Not very comfortable to lie on": "Killing the Lion in the Battle Arena",
    "Poor Cow": "Crafting Leather in the Workshop",
    "Seriously though, who comes up with the names?": "Performing Discovery at the Mount Kwaya",
    "Some people say I'm your best friend. Others just see the money": "Mining Diamonds in The Mines",
    "This tree is a living fossil and has fan shaped leaves": "Chopping Ginkgo Trees with Forestry",
    "Up in the clouds. I'm the king of the world": "Performing Discovery at the Rocky Peaks",
    "Think of the amount of fish I can catch with this beast": "Crafting Large Fishing Nets in the Workshop",
    "Who let the dogs out?": "Killing Wild Dogs in the Battle Arena",
    "Wood!": "Killing the Training Dummy in the Battle Arena",
    "Wana Bet?": "Performing Discovery at the Lake Wana",
    "Wouldnt these be like, really heavy?": "Crafting Iron Boots in the Workshop",
    "Yea no thanks, but I don't like the dark": "Fishing in The Cave",
    "You may need to wrap up warm for this one": "Performing Discovery in the Frozen Wasteland"
  }  